# قم بإنشاء List تحتوي على الأرقام التالية 1, 2, 3, 3, 4, 5, 1
# قم بعمل متغير باسم unique_list ثم قم بتخزين القيم المميزة فقط من ال List السابقة.
# في السطر الأول قم بطباعة محتوى unique_list وتأكد أنها تحتوي على الأرقام المميزة فقط
# في السطر الثاني قم بطباعة نوع unique_list وتأكد أن نوع البيانات هو list
# في السطر الثالث قم بطباعة ال unique_list بدون العنصر الأخير
my_list = [1,2,3,3,4,5,1]
uniue_list = list(set(my_list))
print(uniue_list)
print(type(uniue_list))
print('_'*100)

# قم بإنشاء Set جديدة تحتوي على الأرقام 1, 2, 3
# قم بإنشاء Set جديدة تحتوي على الحروف A, B, C
# قم بدمج ال Set الأولى والثانية بثلاث طرق مختلفة وإطبع كل طريقة في سطر
s1 = {1,2,3}
s2 ={'A','B','C'}
print(s1 ^ s2)
print(s2.union(s1))
print('-'*100)

# قم بإنشاء Set تحتوي على العناصر 1, 2, 3
# في السطر الأول قم بطباعة محتوى ال Set
# قم بإفراغ محتوى ال Set كاملا بسطر واحد فقط ثم قم بطباعة المحتوى في السطر الثاني لتتأكد من أنها فارغة تماما
# قم بإضافة عنصرين “A”, “B” لهذه ال Set ثم إطبع محتواها في السطر الثالث
# قم بمحاولة إزالة العنصر “C” طبعا العنصر غير موجود تأكد أنه لن يخرج لك خطأ عندما تحاول إزالة العنصر الغير موجود
my_set = {1, 2, 3}
letters = {"A", "B", "C"}

print(my_set)
my_set.clear()
print(my_set)
my_set.update({'A','B'})
print(my_set)
my_set.discard('c')
# {1, 2, 3}
# set()
# {"A", "B"}
print('-'*100)

# قم بإنشاء Set تحتوي على العناصر 1, 2, 3
# قم بإنشاء Set ثانية تحتوي على 1, 2, 3, 4, 5, 6
# تأكد ان جميع محتويات ال Set الأولى موجود في الثانية أم لا
set_one = {1, 2, 3}
set_two = {1, 2, 3, 4, 5, 6}

# Needed Output

True




# قم بإنشاء Dictionary يحتوي على ثلاث مهارات برمجية مع النسبة المئوية لمستواك فيهم
# بدون إستخدام ال Loop قم بطباعة كل مهارة في سطر وبجانبها المستوى المكتوب بالنسبة المئوية
# قم بإضافة مهارة جديدة لل Dictionary مع النسبة المئوية الخاصة بها ثم قم بطباعتها في السطر الخامس1
m ={
    'py' :100,
    'c':12,
    'js':12,
}
print(f'py = > {m["py"]}')
m.update({"english":1000})
print(m)